cf/Catalogs/ЗаписиУО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>ЗаписиУО</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.УправленческаяОтчетность</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Источник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИсточникиДанныхУО</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Представление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвтоРезультат</Name>
					<Comment>то что система считает автоматом</Comment>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пояснение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособПолученияРезультата</Name>
					<Comment>0 - вручную; 1 - сумма подчиненных; 2 - Выражение; 3 - Источник</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Результат</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Выражение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ИсторияРезультатов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Пользователь</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Результат</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cf/Catalogs/ЗаписиУО/Ext/ObjectModule.bsl
Функция ОбновитьРезультат() Экспорт
	
	// пересчитывает результат
	
	текРезультат = Справочники.ЗаписиУО.ПолучитьРезультат(Ссылка, Владелец.ДатаНачала, Владелец.ДатаОкончания);
	Если текРезультат = Неопределено Тогда
		
		Возврат Ложь;
		
	ИначеЕсли Результат <> текРезультат Тогда
		
		Результат 		= текРезультат;
		АвтоРезультат 	= текРезультат;
		Возврат ОбщиеФункции.ЗаписатьОбъектИСообщитьЕслиОшибка(ЭтотОбъект); КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

Процедура ПередЗаписью(Отказ)
	
	// Сохраним историю результата
	
	Если Результат И
			(	Не ИсторияРезультатов.Количество() Или
				ИсторияРезультатов[ИсторияРезультатов.Количество() - 1].Результат <> Результат) Тогда
				
		НовЗапись = ИсторияРезультатов.Добавить();
		НовЗапись.Дата 			= ТекущаяДата();
		НовЗапись.Пользователь 	= ПараметрыСеанса.ТекущийПользователь;
		НовЗапись.Результат 	= Результат; КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	// Если результат изменился тогда пересчитаем все зависимые показатели
	
	Если 	ДополнительныеСвойства.Свойство("ИзмененныеРеквизиты") И 
			ДополнительныеСвойства.ИзмененныеРеквизиты.Свойство("Результат") И 
			Результат <> ДополнительныеСвойства.ИзмененныеРеквизиты.Результат Тогда
		
		// Получим соответвие в котором будем хранить ссылки на уже подсчитанные объекты, чтобы повторно из их не пересчитывать
		
		ОтработанныеРезультаты = ?(ДополнительныеСвойства.Свойство("ОтработанныеРезультаты"), ДополнительныеСвойства.ОтработанныеРезультаты, Новый Соответствие);
		Если ОтработанныеРезультаты[Ссылка] <> Истина Тогда ОтработанныеРезультаты.Вставить(Ссылка, Истина);
		
			// Построим цепочку зависимостей чтобы пересчитать зависимые
			
			Запрос = Новый Запрос("
			|ВЫБРАТЬ Ссылка ИЗ Справочник.ЗаписиУО ГДЕ Владелец = &Владелец И СпособПолученияРезультата = 2 И Результат = АвтоРезультат И Не ПометкаУдаления И Выражение ПОДОБНО ""%[" + Код + "]%""
			|ОБЪЕДИНИТЬ
			|ВЫБРАТЬ Ссылка ИЗ Справочник.ЗаписиУО ГДЕ СпособПолученияРезультата = 1 И Ссылка = &Родитель И Результат = АвтоРезультат И Не ПометкаУдаления");
			
			Запрос.УстановитьПараметр("Владелец", 	Владелец);
			Запрос.УстановитьПараметр("Родитель", 	Родитель);
			
			// Пересчитаем их всех заного
			
			Выборка = Запрос.Выполнить().Выбрать();
			Пока Выборка.Следующий() Цикл
				
				ЗависимыйОб = Выборка.Ссылка.ПолучитьОбъект();
				ЗависимыйОб.ДополнительныеСвойства.Вставить("ОтработанныеРезультаты", ОтработанныеРезультаты);
				Если Не ЗависимыйОб.ОбновитьРезультат() Тогда
					Отказ = Истина; КонецЕсли; КонецЦикла; КонецЕсли; КонецЕсли;
	
КонецПроцедуры

Функция ЗаписатьНовыйПоказатель(текРезультат, текАвтоРезультат = Неопределено) Экспорт

	Результат 		= текРезультат;
	АвтоРезультат 	= ?(текАвтоРезультат  = Неопределено, Результат, текАвтоРезультат );
	
	Возврат ОбщиеФункции.ЗаписатьОбъектИСообщитьЕслиОшибка(ЭтотОбъект);
	
КонецФункции
